#######################
#工作流 基础
#R4DS 第3章
#######################

library(tidyverse)


# 1 Coding Basics ---------------------------------------------------------

1 / 200 * 30

(59 + 73 + 2) / 3

sin(pi / 2)

x <- 3 * 4
x


# 2 What’s in a Name? -----------------------------------------------------

r_rocks <- 2 ^ 3
r_rocks


# 3 Calling Functions -----------------------------------------------------

seq(1, 10)

y <- seq(1, 10, length.out = 5)
y

(y <- seq(1, 10, length.out = 5))


# 总结
# 基础R代码编写
# 变量命名
# R语言函数调用
